using System;

namespace Exersice2
{
    /* 
    Задание 2
    Написать метод подсчета количества цифр числа.

    Выполнил: Холкин Константин Юрьевич
    */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Ведите целое число:");
            string a = Console.ReadLine();
            Console.WriteLine(a.Length);
        }
    }
}
